Table of Contents
 Class Hanging
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representing hanging in IDEA StatiCa Detail
[OpenModelClass(typeof(Reinforcement))]
public class Hanging : Reinforcement
Inheritance
object
OpenObject
OpenElementId
Reinforcement
Hanging
Inherited Members
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 Hanging()
Constructor
public Hanging()
Properties
 Angle
Angle between braches
public double Angle { get; set; }
Property Value
double
 BottomLength
Length of inside part of anchor
public double BottomLength { get; set; }
Property Value
double
 Diameter
Diameter o reinforcement
public double Diameter { get; set; }
Property Value
double
 DiameterOfMandrel
Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
public double DiameterOfMandrel { get; set; }
Property Value
double
 EdgeOrientationType
Edge orientation type
public EdgeOrientationType EdgeOrientationType { get; set; }
Property Value
EdgeOrientationType
 EndsType
End type of the reinforcement bar - same for both ends
public LongReinfEndType EndsType { get; set; }
Property Value
LongReinfEndType
 HangingType
Type of hanging
public HangingType HangingType { get; set; }
Property Value
HangingType
 LegsLength
Length of legs
public double LegsLength { get; set; }
Property Value
double
 MasterComponent
Master component of hanging
public ReferenceElement MasterComponent { get; set; }
Property Value
ReferenceElement
 MasterEdge
Master edge of hanging
public ReferenceElement MasterEdge { get; set; }
Property Value
ReferenceElement
 PositionOnEdge
Position on edge
public double PositionOnEdge { get; set; }
Property Value
double
 Radius
Radius of top loop
public double Radius { get; set; }
Property Value
double
 UpperLength
Length of upper part of hanging
public double UpperLength { get; set; }
Property Value
double
 Edit this page